IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE-SORT.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-ARRAY.
   05 WS-NUM PIC 9(4) OCCURS 10 TIMES.

01 I     PIC 9(2).
01 J     PIC 9(2).
01 TEMP  PIC 9(4).

PROCEDURE DIVISION.

DISPLAY "ENTER 10 NUMBERS:".

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    ACCEPT WS-NUM(I)
END-PERFORM.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 9

   PERFORM VARYING J FROM 1 BY 1 UNTIL J > 10 - I

      IF WS-NUM(J) > WS-NUM(J + 1)

         MOVE WS-NUM(J)     TO TEMP
         MOVE WS-NUM(J + 1) TO WS-NUM(J)
         MOVE TEMP          TO WS-NUM(J + 1)

      END-IF

   END-PERFORM

END-PERFORM.

DISPLAY "SORTED NUMBERS (ASCENDING):".

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
   DISPLAY WS-NUM(I)
END-PERFORM.

STOP RUN.
