IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-TO-FAHRENHEIT.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 CELSIUS PIC 9(2)V9(2).
01 FAHRENHEIT PIC 9(3)V9(2).

PROCEDURE DIVISION.

DISPLAY "ENTER THE CELSIUS :".
ACCEPT CELSIUS.

COMPUTE FAHRENHEIT = (CELSIUS * 9/5) + 32.

DISPLAY "CELSIUS CONVERTED TO FAHRENHEIT : " FAHRENHEIT.
