IDENTIFICATION DIVISION.
PROGRAM-ID. COMPOUND-INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 PRINCIPAL      PIC 9(7)V99.
01 RATE           PIC 9(5)V99.
01 TIMEE           PIC 9(3).
01 AMOUNT         PIC 9(9)V99.
01 CI             PIC 9(9)V99.
01 I              PIC 9(3).

PROCEDURE DIVISION.

DISPLAY "ENTER PRINCIPAL AMOUNT : ".
ACCEPT PRINCIPAL.

DISPLAY "ENTER RATE OF INTEREST : ".
ACCEPT RATE.

DISPLAY "ENTER TIME : ".
ACCEPT TIMEE.

MOVE PRINCIPAL TO AMOUNT.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > TIMEE
   COMPUTE AMOUNT = AMOUNT * (1 + RATE / 100)
END-PERFORM.

COMPUTE CI = AMOUNT - PRINCIPAL.

DISPLAY "TOTAL AMOUNT      : " AMOUNT.
DISPLAY "COMPOUND INTEREST : " CI.

STOP RUN.
