IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 IND PIC 9(4).

PROCEDURE DIVISION.

MOVE 1 TO IND.

PERFORM UNTIL IND > 1000

  IF FUNCTION MOD(IND 2) = 0 AND FUNCTION MOD(IND 3) AND FUNCTION MOD(IND 7)
    DISPLAY IND
  END-IF
  
  ADD 1 TO IND
  
END-PERFORM.

STOP RUN.
