IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 NUM  PIC 9(3).
01 ANS  PIC 9(5).
01 TEMP PIC 9(3).

PROCEDURE DIVISION.

DISPLAY "ENTER THE NUMBER :".
ACCEPT NUM.

MOVE NUM TO TEMP.
MOVE 1 TO ANS.

IF NUM = 0
   DISPLAY "THE FACTORIAL : 1"
   STOP RUN
END-IF


PERFORM UNTIL TEMP = 0
  COMPUTE ANS = ANS * TEMP
  COMPUTE TEMP = TEMP - 1
END-PERFORM.

DISPLAY "THE FACTORIAL : " ANS.

STOP RUN.
