IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-A  PIC 9(4) VALUE 1.
01 WS-B  PIC 9(4) VALUE 1.
01 TEMP  PIC 9(4).
01 SUMM  PIC 9(5).

PROCEDURE DIVISION.

MOVE 0 TO SUMM.

DISPLAY "FIBONACCI SERIES TILL 100".

DISPLAY WS-A.
DISPLAY WS-B.

COMPUTE SUMM = WS-A + WS-B.

PERFORM UNTIL TEMP > 100

   COMPUTE TEMP = WS-A + WS-B

   IF TEMP <= 100
      DISPLAY TEMP
      COMPUTE SUMM = SUMM + TEMP
   END-IF

   MOVE WS-B TO WS-A
   MOVE TEMP TO WS-B

END-PERFORM.

DISPLAY "SUM OF SERIES : " SUMM.

STOP RUN.
