IDENTIFICATION DIVISION.
PROGRAM-ID. HELLOWORLD.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 CHOICE  PIC 9(1).
01 SUMM PIC 9(5).
01 REM  PIC 9(5).
01 TEMP PIC 9(5).
01 NUM  PIC 9(5).
01 I  PIC 9(5).

PROCEDURE DIVISION.

  DISPLAY "ENTER THE CHOICE".
  DISPLAY  "1. PALINDROME NUMBER".
  DISPLAY  "2. ARMSTRONG NUMBER".
  DISPLAY  "3. PERFECT  NUMBER".
  DISPLAY  "4. EXIT".
  ACCEPT CHOICE.
  
  EVALUATE CHOICE
    WHEN 1
      PERFORM PALINDROME
    
    WHEN 2
      PERFORM ARMSTRONG
      
    WHEN 3
      PERFORM PERFECT
      
    WHEN 4
      DISPLAY "EXIT"
      DISPLAY "THANK YOU!"
    
    WHEN OTHER
      DISPLAY "INPUT INVALID"
      
    END-EVALUATE
    
STOP RUN.

PALINDROME.
  DISPLAY "ENTER THE NUMBER :"
  ACCEPT NUM
  
  MOVE NUM TO TEMP
  MOVE 0 TO SUMM
  
  PERFORM UNTIL TEMP = 0
    COMPUTE REM = FUNCTION MOD(TEMP 10)
    COMPUTE SUMM = SUMM * 10 + REM
    COMPUTE TEMP = TEMP / 10
  END-PERFORM
  
  IF SUMM = NUM
    DISPLAY "PALINDROME"
  ELSE 
    DISPLAY "NOT A PALINDROME"
    
  END-IF.
  EXIT.
  
ARMSTRONG.
  DISPLAY "ENTER THE NUMBER"
  ACCEPT NUM
  
  MOVE NUM TO TEMP
  MOVE 0 TO SUMM
  
  PERFORM UNTIL TEMP = 0
    COMPUTE REM = FUNCTION MOD(TEMP 10)
    COMPUTE SUMM = SUMM + (REM * REM * REM)
    COMPUTE TEMP = TEMP / 10
  END-PERFORM
  
  IF SUMM = NUM
    DISPLAY "ARMSTRONG NUMBER"
  ELSE
    DISPLAY "NOT A ARMSTRONG NUMBER"
    
  END-IF.
  EXIT.
  
PERFECT.
  
  DISPLAY "ENTER THE NUMBER"
  ACCEPT NUM
  
  MOVE 0 TO SUMM
  MOVE NUM TO TEMP
  
  PERFORM VARYING I FROM 1 BY 1 UNTIL I >= NUM
    IF FUNCTION MOD(NUM I) = 0
      COMPUTE SUMM = SUMM + I
    END-IF
  END-PERFORM
  
  IF SUMM = NUM
    DISPLAY "PERFECT NUMBER"
  ELSE
    DISPLAY "NOT PERFECT"
    
  END-IF.
  EXIT.
    
  
