IDENTIFICATION DIVISION.
PROGRAM-ID. LARGEST.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 FIRSTT  PIC 9(4).
01 SECOND  PIC 9(4).
01 THIRD   PIC 9(4).
01 LARGEST PIC 9(4).

PROCEDURE DIVISION.

DISPLAY "ENTER FIRST NUMBER".
ACCEPT FIRSTT.

DISPLAY "ENTER SECOND NUMBER".
ACCEPT SECOND.

DISPLAY "ENTER THIRD NUMBER".
ACCEPT THIRD.

IF FIRSTT > SECOND AND FIRSTT > THIRD
   MOVE FIRSTT TO LARGEST

ELSE
   IF SECOND > FIRSTT AND SECOND > THIRD
      MOVE SECOND TO LARGEST
   ELSE
      MOVE THIRD TO LARGEST
   END-IF
END-IF.

DISPLAY "THE LARGEST AMONG THREE : " LARGEST.

STOP RUN.
