IDENTIFICATION DIVISION.
PROGRAM-ID. PALINDROME-NUMBER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(5).
01 TEMP PIC 9(5).
01 SUMM PIC 9(5).
01 REM PIC 9(5).

PROCEDURE DIVISION.

 DISPLAY "ENTER THE NUMBER :"
  ACCEPT NUM
  
  MOVE NUM TO TEMP
  MOVE 0 TO SUMM
  
  PERFORM UNTIL TEMP = 0
    COMPUTE REM = FUNCTION MOD(TEMP 10)
    COMPUTE SUMM = SUMM * 10 + REM
    COMPUTE TEMP = TEMP / 10
  END-PERFORM
  
  IF SUMM = NUM
    DISPLAY "PALINDROME"
  ELSE 
    DISPLAY "NOT A PALINDROME"
    
  END-IF.
