IDENTIFICATION DIVISION.
PROGRAM-ID. PRIME-NUMBER.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 NUM PIC 9(3).
01 I   PIC 9(3).
01 COUNTT PIC 9(3).

PROCEDURE DIVISION.

DISPLAY "PRIME CHECKER FROM 1 TO 200".

PERFORM VARYING NUM FROM 2 BY 1 UNTIL NUM > 200
  
  MOVE 0 TO COUNTT
  
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
  
    IF FUNCTION MOD(NUM, I) = 0
      ADD 1 TO COUNTT
    END-IF
  
  END-PERFORM

  IF COUNTT = 2
    DISPLAY NUM
  END-IF

END-PERFORM.

STOP RUN.
