IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE-NUM.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 NUM PIC 9(5).
01 REV PIC 9(5).
01 TEMP PIC 9(5).
01 REM PIC 9(5).

PROCEDURE DIVISION.

DISPLAY "ENTER THE NUMBER : "
ACCEPT NUM

MOVE NUM TO TEMP
MOVE 0 TO REV

PERFORM UNTIL TEMP = 0
  COMPUTE REM = FUNCTION MOD(TEMP 10)
  COMPUTE REV = REV * 10 + REM
  COMPUTE TEMP = TEMP / 10
  
END-PERFORM.

DISPLAY "THE REVERSE OF " NUM " IS " REV

STOP RUN.
