IDENTIFICATION DIVISION.
PROGRAM-ID. SI-CALCULATION.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 PRINCIPAL-A PIC 9(5)V9(2).
01 RATE   PIC 9(5)V9(2).
01 TIMEE PIC 9(5)V9(2).
01 SI PIC 9(5)V9(2).

PROCEDURE DIVISION.

DISPLAY "ENTER THE PRINCIPAL AMOUNT : "
ACCEPT PRINCIPAL-A

DISPLAY "ENTER THE RATE OF INTEREST : "
ACCEPT RATE

DISPLAY "ENTER THE TIME : "
ACCEPT TIMEE

COMPUTE SI = (PRINCIPAL-A * RATE* TIMEE) / 100

DISPLAY "THE SIMPLE INTEREST : " SI

STOP RUN.
