IDENTIFICATION DIVISION.
PROGRAM-ID. STRING-CONCATENATION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 STR1        PIC X(20).
01 STR2        PIC X(20).
01 RESULT      PIC X(40).
01 LEN         PIC 9(2).

PROCEDURE DIVISION.

DISPLAY "ENTER FIRST STRING : ".
ACCEPT STR1.

DISPLAY "ENTER SECOND STRING : ".
ACCEPT STR2.

STRING STR1 DELIMITED BY SPACE
       STR2 DELIMITED BY SPACE
       INTO RESULT
END-STRING.

INSPECT RESULT TALLYING LEN FOR CHARACTERS.

DISPLAY "CONCATENATED STRING : " RESULT.
DISPLAY "LENGTH : " LEN.

STOP RUN.
