IDENTIFICATION DIVISION.
PROGRAM-ID. SUM-USING-OCCURS.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-NUMBERS.
  05 WS-NUMBER PIC 9(4) OCCURS 20 TIMES.
  
01 WS-INDEX PIC 9(4).
01 SUMM PIC 9(5) VALUE 0.

PROCEDURE DIVISION.

DISPLAY "ENTER 20 NUMBERS ".

PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 20
  ACCEPT WS-NUMBER (WS-INDEX)
END-PERFORM.

PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 20
  ADD WS-NUMBER (WS-INDEX) TO SUMM
END-PERFORM.

DISPLAY "THE TOTAL SUM : " SUMM.

STOP RUN.
